// Категории и подкатегории для каталога и CMS
const categoriesData = [
  {
    id: 1,
    name: 'Игрушки',
    label: 'Игрушки',
    icon: '/toys.png',
    active: true,
    sub: [
      'Игрушки для самых маленьких',
      'Куклы',
      'Оружие игрушечное',
      'Треки, паркинги и жд',
      'Мягкие игрушки',
      'Игрушки - антистресс и сквиши',
      'Активные игры',
      'Тематические игровые наборы',
      'Декоративная косметика и украшения',
      'Машинки и другой транспорт',
      'Роботы и трансформеры',
      'Игровые фигурки',
      'Пляжные игрушки',
      'Шарики',
      'Игрушки на радиоуправлении',
      'Брэндовые игрушки'
    ]
  },
  {
    id: 2,
    name: 'Конструкторы',
    label: 'Конструкторы',
    icon: '/constructor.png',
    active: true,
    sub: [
      'Lego для мальчиков',
      'Lego для девочек',
      'Металлические конструкторы',
      'Lego крупные блоки'
    ]
  },
  {
    id: 3,
    name: 'Пазлы',
    label: 'Пазлы',
    icon: '/puzzle.png',
    active: true,
    sub: [
      'Пазлы для взрослых',
      'Пазлы для детей',
      'Магнитные пазлы',
      'Пазлы напольные',
      'Пазлы для малышей'
    ]
  },
  {
    id: 4,
    name: 'Творчество',
    label: 'Творчество',
    icon: '/creativity.png',
    active: true,
    sub: [
      'Наборы для лепки',
      'Наклейки',
      'Лизуны и слаймы',
      'Кинетический песок',
      'Рисование',
      'Наборы для творчества',
      'Раскраски'
    ]
  },
  {
    id: 5,
    name: 'Канцтовары',
    label: 'Канцтовары',
    icon: '/stationery.png',
    active: true,
    sub: [
      'Портфели для школы',
      'Портфели для детских садов',
      'Пеналы',
      'Ручки и карандаши',
      'Точилки',
      'Фломастеры и маркеры',
      'Краски',
      'Кисточки и принадлежности',
      'Брелки'
    ]
  },
  {
    id: 6,
    name: 'Транспорт',
    label: 'Транспорт',
    icon: '/bicycle.png',
    active: true,
    sub: [
      'Детские самокаты',
      'Велосипеды',
      'Ходунки',
      'Беговелы'
    ]
  },
  {
    id: 7,
    name: 'Отдых на воде',
    label: 'Отдых на воде',
    icon: '/voda.png',
    active: true,
    sub: [
      'Бассейны',
      'Матрасы и плотики',
      'Круги надувные',
      'Нарукавники и жилеты',
      'Аксессуары для плавания',
      'Ракетки',
      'Пляжные мячи и игрушки для плавания',
      'Насосы для матрасов'
    ]
  },
  {
    id: 8,
    name: 'Настольные игры',
    label: 'Настольные игры',
    icon: '/nastolka.png',
    active: true,
    sub: [
      'Настольные игры'
    ]
  },
  {
    id: 9,
    name: 'Развивающие игры',
    label: 'Развивающие игры',
    icon: '/edu_game.png',
    active: true,
    sub: [
      'Развивающие игры'
    ]
  },
  {
    id: 10,
    name: 'Акции',
    label: 'Акции',
    icon: '/sale.png',
    active: true,
    sub: [
      'Скидки недели',
      'Товары по акции'
    ]
  }
];

export default categoriesData; 